package p1031_1;

public class Main {
    public static void main(String[] args) {
        //-----------------------------------------------------    
        // 宣告一個陣列, 名稱是data, 長度為5, 內容為字串.
        // 陣列長度設定後即不可再更改.   
        //-----------------------------------------------------        
        String data[] = new String[5];
        
        //-----------------------------------------------------   
        // 將String物件加入data中
        //-----------------------------------------------------      
        data[0]="data0";
        data[1]="data1";
        data[2]="data2";
        data[3]="資料3";
        data[4]="資料4";
        
        //----------------------------------------------      
        // 依序取出data中的字串
        //----------------------------------------------         
        
        
        for (int i = 0; i < data.length; i++) {
            System.out.println(data[i]);
        }
        
        
        for(String s : data){
            System.out.println(s.length());
        }
    }    
}